app/Http/Controllers/GameController.php

    public function index()
    {
        return Game::all();
---
select * from `games`